In [2]:
import numpy as np
import pandas as pd
import csv

Load data in .txt format and transform it into Dataframe

In [7]:
f = open('/Users/lipinyuan/Downloads/Firearm related death.txt').readlines()

data = []
firstLine = f.pop(0)
for line in f:
    data_line = line.rstrip().split('\t')
    data.append(data_line)

df = pd.DataFrame(data)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1822 entries, 0 to 1821
Data columns (total 10 columns):
0    1822 non-null object
1    1740 non-null object
2    1740 non-null object
3    1740 non-null object
4    1740 non-null object
5    1740 non-null object
6    1740 non-null object
7    1740 non-null object
8    1740 non-null object
9    1740 non-null object
dtypes: object(10)
memory usage: 142.4+ KB

Read data and rename the columns

In [9]:
df.head()

,0,1,2,3,4,5,6,7,8,9
0,,"""1999""","""1999""","""Alabama""","""01""","""Intentional self-harm (suicide) by discharge ...","""GR113-125""",436,4430141,9.8
1,,"""1999""","""1999""","""Alabama""","""01""","""Assault (homicide) by discharge of firearms (...","""GR113-128""",293,4430141,6.6
2,,"""1999""","""1999""","""Alaska""","""02""","""Intentional self-harm (suicide) by discharge ...","""GR113-125""",55,624779,8.8
3,,"""1999""","""1999""","""Alaska""","""02""","""Assault (homicide) by discharge of firearms (...","""GR113-128""",27,624779,4.3
4,,"""1999""","""1999""","""Arizona""","""04""","""Intentional self-harm (suicide) by discharge ...","""GR113-125""",477,5023823,9.5

In [10]:
df = df.rename(columns={0: 'Notes', 
                   1: 'Year',
                   2:'Year Code',
                   3:"State",
                   4:"State Code",
                   5:"Death_Cause",
                   6:"Death_Cause_List_Code",
                   7:"Deaths",
                   8:"Population",
                   9:"Crude Rate"})

In [11]:
df.head()

,Notes,Year,Year Code,State,State Code,Death_Cause,Death_Cause_List_Code,Deaths,Population,Crude Rate
0,,"""1999""","""1999""","""Alabama""","""01""","""Intentional self-harm (suicide) by discharge ...","""GR113-125""",436,4430141,9.8
1,,"""1999""","""1999""","""Alabama""","""01""","""Assault (homicide) by discharge of firearms (...","""GR113-128""",293,4430141,6.6
2,,"""1999""","""1999""","""Alaska""","""02""","""Intentional self-harm (suicide) by discharge ...","""GR113-125""",55,624779,8.8
3,,"""1999""","""1999""","""Alaska""","""02""","""Assault (homicide) by discharge of firearms (...","""GR113-128""",27,624779,4.3
4,,"""1999""","""1999""","""Arizona""","""04""","""Intentional self-harm (suicide) by discharge ...","""GR113-125""",477,5023823,9.5

In [12]:
df.dtypes.index

Index(['Notes', 'Year', 'Year Code', 'State', 'State Code', 'Death_Cause',
       'Death_Cause_List_Code', 'Deaths', 'Population', 'Crude Rate'],
      dtype='object')

Extract the data and remove double quotes

In [13]:
df2 = df.drop(df.columns[[0,2,4,6,9]], axis = 1)

In [14]:
df2 = df2.dropna()

In [15]:
df2['State'] = df2['State'].str.replace('"','')
df2['Year'] = df2['Year'].str.replace('"','')
df2['Death_Cause'] = df2['Death_Cause'].str.replace('"','')

In [16]:
df2["Death_Cause"].unique()

array(['Intentional self-harm (suicide) by discharge of firearms (X72-X74)',
       'Assault (homicide) by discharge of firearms (*U01.4,X93-X95)'],
      dtype=object)

Change the long description to simple word

In [17]:
df2 = df2.replace("Intentional self-harm (suicide) by discharge of firearms (X72-X74)","suicide").replace(
    "Assault (homicide) by discharge of firearms (*U01.4,X93-X95)","homicide")

In [35]:
df2.head()

   Year    State Death_Cause  Deaths  Population
0  1999  Alabama     suicide     436     4430141
1  1999  Alabama    homicide     293     4430141
2  1999   Alaska     suicide      55      624779
3  1999   Alaska    homicide      27      624779
4  1999  Arizona     suicide     477     5023823

Transform datatype from object to integer

In [19]:
df2['Deaths'] = df2['Deaths'].astype(np.int)
df2['Population'] = df2['Population'].astype(np.int)

In [20]:
df2.dtypes

Year           object
State          object
Death_Cause    object
Deaths          int64
Population      int64
dtype: object

Separate dataset into two categories

In [21]:
suicide=df2[(df2['Death_Cause'].str.contains('suicide',na=False))]

In [22]:
suicide.head()

   Year       State Death_Cause  Deaths  Population
0  1999     Alabama     suicide     436     4430141
2  1999      Alaska     suicide      55      624779
4  1999     Arizona     suicide     477     5023823
6  1999    Arkansas     suicide     236     2651860
8  1999  California     suicide    1534    33499204

In [23]:
homicide=df2[(df2['Death_Cause'].str.contains('homicide',na=False))]

In [24]:
homicide.head()

   Year       State Death_Cause  Deaths  Population
1  1999     Alabama    homicide     293     4430141
3  1999      Alaska    homicide      27      624779
5  1999     Arizona    homicide     303     5023823
7  1999    Arkansas    homicide     120     2651860
9  1999  California    homicide    1387    33499204

Export Data for visualization in Tableau

In [301]:
df2.to_csv("firearm_death.csv", encoding='utf-8')

In [279]:
homicide.to_csv("homicide_death.csv", encoding='utf-8')

In [275]:
suicide.to_csv("suicide_death.csv", encoding='utf-8')

In [29]:
gun_2013 = pd.read_csv("/Users/lipinyuan/Downloads/State gun death rate.csv")

In [30]:
gun_2013.head()

        State  Death Rate Per 100000  Gun Ownership Percentage
0     Alabama                   17.6                      48.9
1      Alaska                   19.8                      61.7
2     Arizona                   14.1                      32.3
3    Arkansas                   16.8                      57.9
4  California                    7.7                      20.1

In [34]:
death = pd.merge(df2, gun_2013, on='State')

In [36]:
death.head()

,Year,State,Death_Cause,Deaths,Population,Death Rate Per 100000,Gun Ownership Percentage
0,1999,Alabama,suicide,436,4430141,17.6,48.9
1,1999,Alabama,homicide,293,4430141,17.6,48.9
2,2000,Alabama,suicide,428,4447100,17.6,48.9
3,2000,Alabama,homicide,294,4447100,17.6,48.9
4,2001,Alabama,suicide,389,4467634,17.6,48.9

In [41]:
death_2013 = death[death.Year == "2013"]

In [42]:
death_2013.head()

,Year,State,Death_Cause,Deaths,Population,Death Rate Per 100000,Gun Ownership Percentage
28,2013,Alabama,suicide,504,4833722,17.6,48.9
29,2013,Alabama,homicide,318,4833722,17.6,48.9
64,2013,Alaska,suicide,120,735132,19.8,61.7
65,2013,Alaska,homicide,19,735132,19.8,61.7
100,2013,Arizona,suicide,655,6626624,14.1,32.3

In [43]:
death_2013.to_csv("death_2013.csv", encoding='utf-8')